MikroElektronika/core_packages/PIC/XC8/def/PIC16F18344/mcu.h
extern volatile DACCON0bits_t DACCON0bits __at(0x118);
// bitfield macros
#define _DACCON0_DAC1NSS_POSN                               0x0
#define _DACCON0_DAC1NSS_POSITION                           0x0
#define _DACCON0_DAC1NSS_SIZE                               0x1
#define _DACCON0_DAC1NSS_LENGTH                             0x1
#define _DACCON0_DAC1NSS_MASK                               0x1
#define _DACCON0_DAC1PSS_POSN                               0x2
#define _DACCON0_DAC1PSS_POSITION                           0x2
#define _DACCON0_DAC1PSS_SIZE                               0x2
#define _DACCON0_DAC1PSS_LENGTH                             0x2
#define _DACCON0_DAC1PSS_MASK                               0xC
#define _DACCON0_DAC1OE_POSN                                0x5
#define _DACCON0_DAC1OE_POSITION                            0x5
#define _DACCON0_DAC1OE_SIZE                                0x1
#define _DACCON0_DAC1OE_LENGTH                              0x1
#define _DACCON0_DAC1OE_MASK                                0x20
#define _DACCON0_DAC1EN_POSN                                0x7
#define _DACCON0_DAC1EN_POSITION                            0x7
#define _DACCON0_DAC1EN_SIZE                                0x1
#define _DACCON0_DAC1EN_LENGTH                              0x1
#define _DACCON0_DAC1EN_MASK                                0x80
#define _DACCON0_DAC1PSS0_POSN                              0x2
#define _DACCON0_DAC1PSS0_POSITION                          0x2
#define _DACCON0_DAC1PSS0_SIZE                              0x1
#define _DACCON0_DAC1PSS0_LENGTH                            0x1
#define _DACCON0_DAC1PSS0_MASK                              0x4
#define _DACCON0_DAC1PSS1_POSN                              0x3
#define _DACCON0_DAC1PSS1_POSITION                          0x3
#define _DACCON0_DAC1PSS1_SIZE                              0x1
#define _DACCON0_DAC1PSS1_LENGTH                            0x1
#define _DACCON0_DAC1PSS1_MASK                              0x8

// Register: DACCON1
#define DACCON1 DACCON1
extern volatile unsigned char           DACCON1             __at(0x119);
#ifndef _LIB_BUILD
asm("DACCON1 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1R                  :5;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
    };
} DACCON1bits_t;
extern volatile DACCON1bits_t DACCON1bits __at(0x119);
// bitfield macros
#define _DACCON1_DAC1R_POSN                                 0x0
#define _DACCON1_DAC1R_POSITION                             0x0
#define _DACCON1_DAC1R_SIZE                                 0x5
#define _DACCON1_DAC1R_LENGTH                               0x5
#define _DACCON1_DAC1R_MASK                                 0x1F
#define _DACCON1_DAC1R0_POSN                                0x0
#define _DACCON1_DAC1R0_POSITION                            0x0
#define _DACCON1_DAC1R0_SIZE                                0x1
#define _DACCON1_DAC1R0_LENGTH                              0x1
#define _DACCON1_DAC1R0_MASK                                0x1
#define _DACCON1_DAC1R1_POSN                                0x1
#define _DACCON1_DAC1R1_POSITION                            0x1
#define _DACCON1_DAC1R1_SIZE                                0x1
#define _DACCON1_DAC1R1_LENGTH                              0x1
#define _DACCON1_DAC1R1_MASK                                0x2
#define _DACCON1_DAC1R2_POSN                                0x2
#define _DACCON1_DAC1R2_POSITION                            0x2
#define _DACCON1_DAC1R2_SIZE                                0x1
#define _DACCON1_DAC1R2_LENGTH                              0x1
#define _DACCON1_DAC1R2_MASK                                0x4
#define _DACCON1_DAC1R3_POSN                                0x3
#define _DACCON1_DAC1R3_POSITION                            0x3
#define _DACCON1_DAC1R3_SIZE                                0x1
#define _DACCON1_DAC1R3_LENGTH                              0x1
#define _DACCON1_DAC1R3_MASK                                0x8
#define _DACCON1_DAC1R4_POSN                                0x4
#define _DACCON1_DAC1R4_POSITION                            0x4
#define _DACCON1_DAC1R4_SIZE                                0x1
#define _DACCON1_DAC1R4_LENGTH                              0x1
#define _DACCON1_DAC1R4_MASK                                0x10

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x18C);
#ifndef _LIB_BUILD
asm("ANSELA equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned                        :1;
        unsigned ANSA4                  :1;
        unsigned ANSA5                  :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x18C);
// bitfield macros
#define _ANSELA_ANSA0_POSN                                  0x0
#define _ANSELA_ANSA0_POSITION                              0x0
#define _ANSELA_ANSA0_SIZE                                  0x1
#define _ANSELA_ANSA0_LENGTH                                0x1
#define _ANSELA_ANSA0_MASK                                  0x1
#define _ANSELA_ANSA1_POSN                                  0x1
#define _ANSELA_ANSA1_POSITION                              0x1
#define _ANSELA_ANSA1_SIZE                                  0x1
#define _ANSELA_ANSA1_LENGTH                                0x1
#define _ANSELA_ANSA1_MASK                                  0x2
#define _ANSELA_ANSA2_POSN                                  0x2
#define _ANSELA_ANSA2_POSITION                              0x2
#define _ANSELA_ANSA2_SIZE                                  0x1
#define _ANSELA_ANSA2_LENGTH                                0x1
#define _ANSELA_ANSA2_MASK                                  0x4
#define _ANSELA_ANSA4_POSN                                  0x4
#define _ANSELA_ANSA4_POSITION                              0x4
#define _ANSELA_ANSA4_SIZE                                  0x1
#define _ANSELA_ANSA4_LENGTH                                0x1
#define _ANSELA_ANSA4_MASK                                  0x10
#define _ANSELA_ANSA5_POSN                                  0x5
#define _ANSELA_ANSA5_POSITION                              0x5
#define _ANSELA_ANSA5_SIZE                                  0x1
#define _ANSELA_ANSA5_LENGTH                                0x1
#define _ANSELA_ANSA5_MASK                                  0x20

// Register: ANSELB
#define ANSELB ANSELB
extern volatile unsigned char           ANSELB              __at(0x18D);
#ifndef _LIB_BUILD
asm("ANSELB equ 018Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned ANSB4                  :1;
        unsigned ANSB5                  :1;
        unsigned ANSB6                  :1;
        unsigned ANSB7                  :1;
    };
} ANSELBbits_t;
extern volatile ANSELBbits_t ANSELBbits __at(0x18D);
// bitfield macros
#define _ANSELB_ANSB4_POSN                                  0x4
#define _ANSELB_ANSB4_POSITION                              0x4
#define _ANSELB_ANSB4_SIZE                                  0x1
#define _ANSELB_ANSB4_LENGTH                                0x1
#define _ANSELB_ANSB4_MASK                                  0x10
#define _ANSELB_ANSB5_POSN                                  0x5
#define _ANSELB_ANSB5_POSITION                              0x5
#define _ANSELB_ANSB5_SIZE                                  0x1
#define _ANSELB_ANSB5_LENGTH                                0x1
#define _ANSELB_ANSB5_MASK                                  0x20
#define _ANSELB_ANSB6_POSN                                  0x6
#define _ANSELB_ANSB6_POSITION                              0x6
#define _ANSELB_ANSB6_SIZE                                  0x1
#define _ANSELB_ANSB6_LENGTH                                0x1
#define _ANSELB_ANSB6_MASK                                  0x40
#define _ANSELB_ANSB7_POSN                                  0x7
#define _ANSELB_ANSB7_POSITION                              0x7
#define _ANSELB_ANSB7_SIZE                                  0x1
#define _ANSELB_ANSB7_LENGTH                                0x1
#define _ANSELB_ANSB7_MASK                                  0x80

// Register: ANSELC
#define ANSELC ANSELC
extern volatile unsigned char           ANSELC              __at(0x18E);
#ifndef _LIB_BUILD
asm("ANSELC equ 018Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSC0                  :1;
        unsigned ANSC1                  :1;
        unsigned ANSC2                  :1;
        unsigned ANSC3                  :1;
        unsigned ANSC4                  :1;
        unsigned ANSC5                  :1;
        unsigned ANSC6                  :1;
        unsigned ANSC7                  :1;
    };
} ANSELCbits_t;
