MikroElektronika/core_packages/PIC/XC8/def/PIC16F18344/mcu.h
extern volatile PMDATLbits_t PMDATLbits __at(0x893);
// bitfield macros
#define _PMDATL_NVMDATL_POSN                                0x0
#define _PMDATL_NVMDATL_POSITION                            0x0
#define _PMDATL_NVMDATL_SIZE                                0x8
#define _PMDATL_NVMDATL_LENGTH                              0x8
#define _PMDATL_NVMDATL_MASK                                0xFF
#define _PMDATL_NVMDAT0_POSN                                0x0
#define _PMDATL_NVMDAT0_POSITION                            0x0
#define _PMDATL_NVMDAT0_SIZE                                0x1
#define _PMDATL_NVMDAT0_LENGTH                              0x1
#define _PMDATL_NVMDAT0_MASK                                0x1
#define _PMDATL_NVMDAT1_POSN                                0x1
#define _PMDATL_NVMDAT1_POSITION                            0x1
#define _PMDATL_NVMDAT1_SIZE                                0x1
#define _PMDATL_NVMDAT1_LENGTH                              0x1
#define _PMDATL_NVMDAT1_MASK                                0x2
#define _PMDATL_NVMDAT2_POSN                                0x2
#define _PMDATL_NVMDAT2_POSITION                            0x2
#define _PMDATL_NVMDAT2_SIZE                                0x1
#define _PMDATL_NVMDAT2_LENGTH                              0x1
#define _PMDATL_NVMDAT2_MASK                                0x4
#define _PMDATL_NVMDAT3_POSN                                0x3
#define _PMDATL_NVMDAT3_POSITION                            0x3
#define _PMDATL_NVMDAT3_SIZE                                0x1
#define _PMDATL_NVMDAT3_LENGTH                              0x1
#define _PMDATL_NVMDAT3_MASK                                0x8
#define _PMDATL_NVMDAT4_POSN                                0x4
#define _PMDATL_NVMDAT4_POSITION                            0x4
#define _PMDATL_NVMDAT4_SIZE                                0x1
#define _PMDATL_NVMDAT4_LENGTH                              0x1
#define _PMDATL_NVMDAT4_MASK                                0x10
#define _PMDATL_NVMDAT5_POSN                                0x5
#define _PMDATL_NVMDAT5_POSITION                            0x5
#define _PMDATL_NVMDAT5_SIZE                                0x1
#define _PMDATL_NVMDAT5_LENGTH                              0x1
#define _PMDATL_NVMDAT5_MASK                                0x20
#define _PMDATL_NVMDAT6_POSN                                0x6
#define _PMDATL_NVMDAT6_POSITION                            0x6
#define _PMDATL_NVMDAT6_SIZE                                0x1
#define _PMDATL_NVMDAT6_LENGTH                              0x1
#define _PMDATL_NVMDAT6_MASK                                0x40
#define _PMDATL_NVMDAT7_POSN                                0x7
#define _PMDATL_NVMDAT7_POSITION                            0x7
#define _PMDATL_NVMDAT7_SIZE                                0x1
#define _PMDATL_NVMDAT7_LENGTH                              0x1
#define _PMDATL_NVMDAT7_MASK                                0x80
#define _PMDATL_EEDATL_POSN                                 0x0
#define _PMDATL_EEDATL_POSITION                             0x0
#define _PMDATL_EEDATL_SIZE                                 0x8
#define _PMDATL_EEDATL_LENGTH                               0x8
#define _PMDATL_EEDATL_MASK                                 0xFF
#define _PMDATL_PMDATL_POSN                                 0x0
#define _PMDATL_PMDATL_POSITION                             0x0
#define _PMDATL_PMDATL_SIZE                                 0x8
#define _PMDATL_PMDATL_LENGTH                               0x8
#define _PMDATL_PMDATL_MASK                                 0xFF

// Register: NVMDATH
#define NVMDATH NVMDATH
extern volatile unsigned char           NVMDATH             __at(0x894);
#ifndef _LIB_BUILD
asm("NVMDATH equ 0894h");
#endif
// aliases
extern volatile unsigned char           EEDATH              __at(0x894);
#ifndef _LIB_BUILD
asm("EEDATH equ 0894h");
#endif
extern volatile unsigned char           PMDATH              __at(0x894);
#ifndef _LIB_BUILD
asm("PMDATH equ 0894h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMDATH                :6;
    };
    struct {
        unsigned NVMDAT8                :1;
        unsigned NVMDAT9                :1;
        unsigned NVMDAT10               :1;
        unsigned NVMDAT11               :1;
        unsigned NVMDAT12               :1;
        unsigned NVMDAT13               :1;
    };
    struct {
        unsigned EEDATH                 :6;
    };
    struct {
        unsigned PMDATH                 :6;
    };
} NVMDATHbits_t;
extern volatile NVMDATHbits_t NVMDATHbits __at(0x894);
// bitfield macros
#define _NVMDATH_NVMDATH_POSN                               0x0
#define _NVMDATH_NVMDATH_POSITION                           0x0
#define _NVMDATH_NVMDATH_SIZE                               0x6
#define _NVMDATH_NVMDATH_LENGTH                             0x6
#define _NVMDATH_NVMDATH_MASK                               0x3F
#define _NVMDATH_NVMDAT8_POSN                               0x0
#define _NVMDATH_NVMDAT8_POSITION                           0x0
#define _NVMDATH_NVMDAT8_SIZE                               0x1
#define _NVMDATH_NVMDAT8_LENGTH                             0x1
#define _NVMDATH_NVMDAT8_MASK                               0x1
#define _NVMDATH_NVMDAT9_POSN                               0x1
#define _NVMDATH_NVMDAT9_POSITION                           0x1
#define _NVMDATH_NVMDAT9_SIZE                               0x1
#define _NVMDATH_NVMDAT9_LENGTH                             0x1
#define _NVMDATH_NVMDAT9_MASK                               0x2
#define _NVMDATH_NVMDAT10_POSN                              0x2
#define _NVMDATH_NVMDAT10_POSITION                          0x2
#define _NVMDATH_NVMDAT10_SIZE                              0x1
#define _NVMDATH_NVMDAT10_LENGTH                            0x1
#define _NVMDATH_NVMDAT10_MASK                              0x4
#define _NVMDATH_NVMDAT11_POSN                              0x3
#define _NVMDATH_NVMDAT11_POSITION                          0x3
#define _NVMDATH_NVMDAT11_SIZE                              0x1
#define _NVMDATH_NVMDAT11_LENGTH                            0x1
#define _NVMDATH_NVMDAT11_MASK                              0x8
#define _NVMDATH_NVMDAT12_POSN                              0x4
#define _NVMDATH_NVMDAT12_POSITION                          0x4
#define _NVMDATH_NVMDAT12_SIZE                              0x1
#define _NVMDATH_NVMDAT12_LENGTH                            0x1
#define _NVMDATH_NVMDAT12_MASK                              0x10
#define _NVMDATH_NVMDAT13_POSN                              0x5
#define _NVMDATH_NVMDAT13_POSITION                          0x5
#define _NVMDATH_NVMDAT13_SIZE                              0x1
#define _NVMDATH_NVMDAT13_LENGTH                            0x1
#define _NVMDATH_NVMDAT13_MASK                              0x20
#define _NVMDATH_EEDATH_POSN                                0x0
#define _NVMDATH_EEDATH_POSITION                            0x0
#define _NVMDATH_EEDATH_SIZE                                0x6
#define _NVMDATH_EEDATH_LENGTH                              0x6
#define _NVMDATH_EEDATH_MASK                                0x3F
#define _NVMDATH_PMDATH_POSN                                0x0
#define _NVMDATH_PMDATH_POSITION                            0x0
#define _NVMDATH_PMDATH_SIZE                                0x6
#define _NVMDATH_PMDATH_LENGTH                              0x6
#define _NVMDATH_PMDATH_MASK                                0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned NVMDATH                :6;
    };
    struct {
        unsigned NVMDAT8                :1;
        unsigned NVMDAT9                :1;
        unsigned NVMDAT10               :1;
        unsigned NVMDAT11               :1;
        unsigned NVMDAT12               :1;
        unsigned NVMDAT13               :1;
    };
    struct {
        unsigned EEDATH                 :6;
    };
    struct {
        unsigned PMDATH                 :6;
    };
} EEDATHbits_t;
